{
    "experiences": [
        {
            "title": "Developer",
            "subtitle": "Geico Tech , Dallas TX",
            "workDescription": [
                "Implemented network infrastructure for multiple offices, including two small sites (150–200 users each) and one large site (1,400+ users), improving scalability, redundancy, and system availability across the organization.",
                "Deployed and configured enterprise network infrastructure including Cisco switches (DMZ, core, access), Palo Alto IONs, Lantronix console servers, and firewalls, completing full end-to-end cabling and installation to ensure reliable connectivity.",
                "Built and configured F5 VIPs, pools, nodes, profiles, SNI policies, and SSL certificates for internal and external applications.",
                "Streamlined F5 operations by developing Python Jinja2 templates to automate VIP creation, SSL profile updates, and node-to-VIP modifications, integrated with CI/CD pipelines for pre- and post-deployment validation.",
                "Developed Ansible playbooks to automate SNMP and syslog validation across the Denver and McLean data centers, improving configuration consistency and operational efficiency.",
                "Migrated configurations from Plaza F5 to McLean F5 data center devices, upgraded F5 infrastructure, and integrated traffic into the GTM, ensuring seamless network continuity and high availability."
            ],
            "dateText": "11/2024 – Present"
        },
        {
            "title": "Developer",
            "subtitle": "Mouser Electronics, Mansfield TX",
            "workDescription": [
                "Deployed monitoring scripts across 600+ servers, capturing metrics, connectivity, and netstat data for analysis.",
                "Developed Python scripts to aggregate network and application availability data from Website Pulse, Binary Canary, and Pingdom.",
                "Built executive dashboards in Splunk integrating multiple monitoring sources to provide end-to-end network and server visibility.",
                "Engineered a web dashboard for managing subscriptions, distribution lists, and monitoring access controls for the Dashboard."
            ],
            "dateText": "07/2023 – 11/2024"
        },

        {
            "title": "Software Developer Intern",
            "subtitle": "Intel Corporation, California, US",
            "workDescription": [
                "Developed a workshop management platform using Intel’s oneAPI to automate provisioning of compute nodes for HPC workloads.",
                "Built web dashboards to visualize compute node health, job activity, and network utilization, and troubleshooting.",
                "Implemented REST APIs with Slurm to enable job submission, cancellation, and resource allocation via a centralized web interface."
            ],
            "dateText": "08/2022 – 05/2023"
        },
        {
            "title": "Web Operation Intern",
            "subtitle": "Mouser Electronics, Mansfield TX",
            "workDescription": [
                "Migrated legacy PHP scripts to Python to automate synchronization of images, datasheets, and static files between local servers and Akamai CDN, improving scalability and reliability.",
                "eveloped automation to compare local files with CDN content hourly, updating the database and triggering alerts for discrepancies."
            ],
            "dateText": "06/2022 – 08/2022"
        },
        {
            "title": "Project Intern",
            "subtitle": "Paragon Dynamics and Info Systems",
            "workDescription": [
                "Developed a web-application using Python Flask that overcomes the hazels faced by faculties in a classroom. Deployed a Face Recognition based attendance system on Raspberry Pi to capture live attendance.",
                "Designed an NLP based Answer script evaluator."
            ],
            "dateText": "05/2020 – 06/2020"
        }
    ]
}